# language: ru

  @Smoke @Calc
  Функционал: Калькулятор

    @test1 @Sum
    Сценарий: Проверка расчета суммы
      Дано два числа 5 и 10
      И находим сумму двух чисел
      И выводим сумму на экран

    @test2 @Diff
    Сценарий: Проверка расчета разности
      Дано два числа 5 и 10
      И находим разность двух чисел
      И выводим разность на экран

    @test2 @Mult
    Сценарий: Проверка расчета произведения
      Дано два числа 5 и 10
      * находим произведение двух чисел
      * выводим произведение на экран

    @test2 @Div
    Сценарий: Проверка расчета частного
      Дано два числа 5 и 10
      * находим частное двух чисел
      * выводим частное на экран


